# brew bundle cleanup --force
tap 'universal-ctags/universal-ctags'

brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'cask'
brew 'cmake' # build youcompleteme
brew 'coreutils'
brew 'fzf'
brew 'git'
brew 'go'
brew 'heroku'
brew 'jq'
brew 'nginx'
brew 'nvm'
brew 'postgres'
brew 'pssh'
brew 'python'
brew 'rbenv'
brew 'reattach-to-user-namespace' # connect tmux to the OS X clipboard service
brew 'rg'
brew 'shellcheck'
brew 'tmux'
brew 'tree'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD', 'without-doc']
brew 'vim'
brew 'yarn'

# gui apps
cask 'google-chrome'
cask 'docker'

# fonts
#tap 'homebrew/cask-fonts'
#cask 'font-inconsolata'
#cask 'font-fira-code'
